dave/ruby/rails/forms101/app/controllers/flights_controller.rb

  def index
    @flights = Flight.all
---
SELECT * FROM "flights"

  def show
    @flight = Flight.find(params[:id])
---
SELECT * FROM "flights" WHERE ("flights"."id" = 1)

  def new
    @flight = Flight.new(params[:flight])

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("number", "created_at", "updated_at") VALUES(NULL, '2010-08-22 02:06:41', '2010-08-22 02:06:41')

  def edit
    @flight = Flight.find(params[:id])
---
SELECT * FROM "flights" WHERE ("flights"."id" = 1)

  def create
    @flight = Flight.new(params[:flight])

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("number", "created_at", "updated_at") VALUES('344', '2010-08-22 01:47:31', '2010-08-22 01:47:31')