ruby/app/controllers/logins_controller.rb

SELECT * FROM `logins`
---
  def index
    @logins = Login.all

SELECT * FROM `logins` WHERE (`logins`.`id` = 1)
---
  def show
    @login = Login.find(params[:id])

SELECT * FROM `logins` WHERE (`logins`.`id` = 1)
---
  def edit
    @login = Login.find(params[:id])

INSERT INTO `logins` (`created_at`, `updated_at`, `user`, `passwd`) VALUES('2010-08-15 05:47:13', '2010-08-15 05:47:13', '5am', 'foobar')
---
  def create
    @login = Login.new(params[:login])

    respond_to do |format|
      if @login.save