app/controllers/statuses_controller.rb

  def index
    @statuses = Status.all
---
SELECT * FROM `statuses`

  def show
    @status = Status.find(params[:id])
---
SELECT * FROM `statuses` WHERE (`statuses`.`id` = 1)

  def edit
    @status = Status.find(params[:id])
---
SELECT * FROM `statuses` WHERE (`statuses`.`id` = 1)

  def create
    @status = current_user.statuses.build(permitted_params)

    respond_to do |format|
      if @status.save
---
INSERT INTO `statuses` (`name`, `created_at`, `available`, `updated_at`, `amount`) VALUES('dave', '2010-08-15 02:50:31', 1, '2010-08-15 02:50:31', NULL)

  def update
    @status = Status.find(params[:id])
---
SELECT * FROM `statuses` WHERE (`statuses`.`id` = 2)